BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90PWM316.PIC
        <edc:AdjustPoint edc:_addr="0xD1" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xD2" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR0SA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0"/>
        <edc:SFRDef edc:_addr="0xD4" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR0RA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0"/>
        <edc:SFRDef edc:_addr="0xD6" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR0SB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0"/>
        <edc:SFRDef edc:_addr="0xD8" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR0RB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0"/>
        <edc:SFRDef edc:_addr="0xDA" edc:access="nnnnnnn-" edc:cname="PCNF0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PCLKSEL0" edc:desc="PSC 0 Input Clock Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POP0" edc:desc="PSC 0 Output Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMODE0" edc:desc="PSC 0 Mode" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PLOCK0" edc:desc="PSC 0 Lock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PALOCK0" edc:desc="PSC 0 Autolock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PFIFTY0" edc:desc="PSC 0 Fifty" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDB" edc:access="nnnnnnnn" edc:cname="PCTL0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRUN0" edc:desc="PSC 0 Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCCYC0" edc:desc="PSC0 Complete Cycle" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PARUN0" edc:desc="PSC0 Auto Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAOC0A" edc:desc="PSC 0 Asynchronous Output Control A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAOC0B" edc:desc="PSC 0 Asynchronous Output Control B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PBFM0" edc:desc="PSC 0 Balance Flank Width Modulation" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPRE0" edc:desc="PSC 0 Prescaler Selects" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDC" edc:access="nnnnnnnn" edc:cname="PFRC0A" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM0A" edc:desc="PSC 0 Retrigger and Fault Mode for Part A" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE0A" edc:desc="PSC 0 Filter Enable on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV0A" edc:desc="PSC 0 Edge Level Selector on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL0A" edc:desc="PSC 0 Input Select for Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE0A" edc:desc="PSC 0 Capture Enable Input Part A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDD" edc:access="nnnnnnnn" edc:cname="PFRC0B" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM0B" edc:desc="PSC 0 Retrigger and Fault Mode for Part B" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE0B" edc:desc="PSC 0 Filter Enable on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV0B" edc:desc="PSC 0 Edge Level Selector on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL0B" edc:desc="PSC 0 Input Select for Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE0B" edc:desc="PSC 0 Capture Enable Input Part B" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDE" edc:access="n---nnnnnnnnnnnn" edc:cname="PICR0" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PICR0" edc:desc="PSC 0 Input Capture Bytes" edc:nzwidth="0xC"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="PCST0" edc:desc="PSC 0 Input Capture Software Trig" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE0" edc:access="--nn-n-n" edc:cname="PSOC1" edc:nzwidth="0x8" ltx:memberofperipheral="PSC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POEN1A" edc:desc="PSCOUT10 Output Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN1B" edc:desc="PSCOUT11 Output Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PSYNC1_" edc:desc="Synchronization Out for ADC Selection" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xE1" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xE2" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR1SA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC1"/>
        <edc:SFRDef edc:_addr="0xE4" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR1RA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC1"/>
        <edc:SFRDef edc:_addr="0xE6" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR1SB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC1"/>
        <edc:SFRDef edc:_addr="0xE8" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR1RB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC1"/>
        <edc:SFRDef edc:_addr="0xEA" edc:access="nnnnnnn-" edc:cname="PCNF1" edc:nzwidth="0x8" ltx:memberofperipheral="PSC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PCLKSEL1" edc:desc="PSC 1 Input Clock Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POP1" edc:desc="PSC 1 Output Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMODE1" edc:desc="PSC 1 Mode" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PLOCK1" edc:desc="PSC 1 Lock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PALOCK1" edc:desc="PSC 1 Autolock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PFIFTY1" edc:desc="PSC 1 Fifty" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
