BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90PWM316.PIC
        <edc:SFRDef edc:_addr="0xEB" edc:access="nnnnnnnn" edc:cname="PCTL1" edc:nzwidth="0x8" ltx:memberofperipheral="PSC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRUN1" edc:desc="PSC 1 Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCCYC1" edc:desc="PSC1 Complete Cycle" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PARUN1" edc:desc="PSC1 Auto Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAOC1A" edc:desc="PSC 1 Asynchronous Output Control A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAOC1B" edc:desc="PSC 1 Asynchronous Output Control B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PBFM1" edc:desc="Balance Flank Width Modulation" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPRE1" edc:desc="PSC 1 Prescaler Selects" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEC" edc:access="nnnnnnnn" edc:cname="PFRC1A" edc:nzwidth="0x8" ltx:memberofperipheral="PSC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM1A" edc:desc="PSC 1 Retrigger and Fault Mode for Part A" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE1A" edc:desc="PSC 1 Filter Enable on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV1A" edc:desc="PSC 1 Edge Level Selector on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL1A" edc:desc="PSC 1 Input Select for Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE1A" edc:desc="PSC 1 Capture Enable Input Part A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xED" edc:access="nnnnnnnn" edc:cname="PFRC1B" edc:nzwidth="0x8" ltx:memberofperipheral="PSC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM1B" edc:desc="PSC 1 Retrigger and Fault Mode for Part B" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE1B" edc:desc="PSC 1 Filter Enable on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV1B" edc:desc="PSC 1 Edge Level Selector on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL1B" edc:desc="PSC 1 Input Select for Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE1B" edc:desc="PSC 1 Capture Enable Input Part B" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEE" edc:access="n---nnnnnnnnnnnn" edc:cname="PICR1" edc:nzwidth="0x10" ltx:memberofperipheral="PSC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PICR1" edc:desc="PSC 1 Input Capture Bytes" edc:nzwidth="0xC"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="PCST1" edc:desc="PSC 1 Input Capture Software Trig" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF0" edc:access="nnnnnnnn" edc:cname="PSOC2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POEN2A" edc:desc="PSCOUT20 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN2C" edc:desc="PSCOUT22 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN2B" edc:desc="PSCOUT21 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN2D" edc:desc="PSCOUT23 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSYNC2_" edc:desc="Synchronization Out for ADC Selection" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="POS2" edc:desc="PSC 2 Output 23 Select" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF1" edc:access="nnnnnnnn" edc:cname="POM2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POMV2A" edc:desc="Output Matrix Output A Ramps" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="POMV2B" edc:desc="Output Matrix Output B Ramps" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF2" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR2SA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC2"/>
        <edc:SFRDef edc:_addr="0xF4" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR2RA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC2"/>
        <edc:SFRDef edc:_addr="0xF6" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR2SB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC2"/>
        <edc:SFRDef edc:_addr="0xF8" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR2RB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC2"/>
        <edc:SFRDef edc:_addr="0xFA" edc:access="nnnnnnnn" edc:cname="PCNF2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POME2" edc:desc="PSC 2 Output Matrix Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCLKSEL2" edc:desc="PSC 2 Input Clock Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POP2" edc:desc="PSC 2 Output Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMODE2" edc:desc="PSC 2 Mode" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PLOCK2" edc:desc="PSC 2 Lock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PALOCK2" edc:desc="PSC 2 Autolock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PFIFTY2" edc:desc="PSC 2 Fifty" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xFB" edc:access="nnnnnnnn" edc:cname="PCTL2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRUN2" edc:desc="PSC 2 Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCCYC2" edc:desc="PSC2 Complete Cycle" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PARUN2" edc:desc="PSC2 Auto Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAOC2A" edc:desc="PSC 2 Asynchronous Output Control A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAOC2B" edc:desc="PSC 2 Asynchronous Output Control B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PBFM2" edc:desc="Balance Flank Width Modulation" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPRE2" edc:desc="PSC 2 Prescaler Selects" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xFC" edc:access="nnnnnnnn" edc:cname="PFRC2A" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM2A" edc:desc="PSC 2 Retrigger and Fault Mode for Part A" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE2A" edc:desc="PSC 2 Filter Enable on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV2A" edc:desc="PSC 2 Edge Level Selector on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL2A" edc:desc="PSC 2 Input Select for Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE2A" edc:desc="PSC 2 Capture Enable Input Part A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xFD" edc:access="nnnnnnnn" edc:cname="PFRC2B" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM2B" edc:desc="PSC 2 Retrigger and Fault Mode for Part B" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE2B" edc:desc="PSC 2 Filter Enable on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV2B" edc:desc="PSC 2 Edge Level Selector on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL2B" edc:desc="PSC 2 Input Select for Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE2B" edc:desc="PSC 2 Capture Enable Input Part B" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
